ten_deities_map = {
    "比": "比肩",
    "劫": "劫財",
    "食": "食神",
    "伤": "傷官",
    "才": "偏財",
    "财": "正財",
    "杀": "七殺",
    "官": "正官",
    "枭": "梟神",
    "印": "正印",
    "沐": "沐浴",
    "冠": "冠帶",
    "建": "臨官",
    "帝": "帝旺",
    "衰": "衰",
    "病": "病",
    "死": "死",
    "墓": "墓",
    "绝": "絕",
    "胎": "胎",
    "养": "養",
    "长": "長生",
    "unknown": "未知"
}

nayins_map = {
    "海中金": "海中金",
    "金泊金": "金泊金",
    "白蜡金": "白蠟金",
    "砂中金": "砂中金",
    "剑锋金": "劍鋒金",
    "钗钏金": "釵釧金",
    "霹雳火": "霹靂火",
    "炉中火": "爐中火",
    "覆灯火": "覆燈火",
    "天上火": "天上火",
    "山下火": "山下火",
    "山头火": "山頭火",
    "桑柘木": "桑柘木",
    "松柏木": "松柏木",
    "大林木": "大林木",
    "杨柳木": "楊柳木",
    "石榴木": "石榴木",
    "平地土": "平地土",
    "壁上土": "壁上土",
    "城头土": "城頭土",
    "砂中土": "砂中土",
    "路旁土": "路旁土",
    "大驿土": "大驛土",
    "屋上土": "屋上土",
    "涧下水": "澗下水",
    "大溪水": "大溪水",
    "长流水": "長流水",
    "天河水": "天河水",
    "井泉水": "井泉水",
    "大海水": "大海水",
    "unknown": "未知"
}
shensha_rules = [
    {
        "name": "華蓋",
        "key_type": "zhi",
        "value_type": "zhi",
        "key_pillar": ["year", "day"],
        "mapping": {
            "子": ["辰"],
            "丑": ["丑"],
            "寅": ["戌"],
            "卯": ["未"],
            "辰": ["辰"],
            "巳": ["丑"],
            "午": ["戌"],
            "未": ["未"],
            "申": ["辰"],
            "酉": ["丑"],
            "戌": ["戌"],
            "亥": ["未"],
        }
    },
    {
        "name": "將星",
        "key_type": "zhi",
        "value_type": "zhi",
        "key_pillar": ["year", "day"],
        "mapping": {
            "子": ["子"],
            "丑": ["酉"],
            "寅": ["午"],
            "卯": ["卯"],
            "辰": ["子"],
            "巳": ["酉"],
            "午": ["午"],
            "未": ["卯"],
            "申": ["子"],
            "酉": ["酉"],
            "戌": ["午"],
            "亥": ["卯"],
        }
    },
    {
        "name": "驛馬",
        "key_type": "zhi",
        "value_type": "zhi",
        "key_pillar": ["year", "day"],
        "mapping": {
            "子": ["寅"],
            "丑": ["亥"],
            "寅": ["申"],
            "卯": ["巳"],
            "辰": ["寅"],
            "巳": ["亥"],
            "午": ["申"],
            "未": ["巳"],
            "申": ["寅"],
            "酉": ["亥"],
            "戌": ["申"],
            "亥": ["巳"],
        }
    },
    {
        "name": "桃花",
        "key_type": "zhi",
        "value_type": "zhi",
        "key_pillar": ["year", "day"],
        "mapping": {
            "子": ["酉"],
            "丑": ["午"],
            "寅": ["卯"],
            "卯": ["子"],
            "辰": ["酉"],
            "巳": ["午"],
            "午": ["卯"],
            "未": ["子"],
            "申": ["酉"],
            "酉": ["午"],
            "戌": ["卯"],
            "亥": ["子"],
        }
    },
    {
        "name": "隔角",
        "key_type": "zhi",
        "value_type": "zhi",
        "key_pillar": ["year", "day"],
        "mapping": {
            "子": ["寅"],
            "丑": ["卯"],
            "寅": ["辰"],
            "卯": ["巳"],
            "辰": ["午"],
            "巳": ["未"],
            "午": ["申"],
            "未": ["酉"],
            "申": ["戌"],
            "酉": ["亥"],
            "戌": ["子"],
            "亥": ["丑"],
        }
    },
    {
        "name": "孤辰",
        "key_type": "zhi",
        "value_type": "zhi",
        "key_pillar": ["year", "day"],
        "mapping": {
            "子": ["寅"],
            "丑": ["寅"],
            "寅": ["巳"],
            "卯": ["巳"],
            "辰": ["巳"],
            "巳": ["申"],
            "午": ["申"],
            "未": ["申"],
            "申": ["亥"],
            "酉": ["亥"],
            "戌": ["亥"],
            "亥": ["寅"],
        }
    },
    {
        "name": "寡宿",
        "key_type": "zhi",
        "value_type": "zhi",
        "key_pillar": ["year", "day"],
        "mapping": {
            "子": ["戌"],
            "丑": ["戌"],
            "寅": ["丑"],
            "卯": ["丑"],
            "辰": ["丑"],
            "巳": ["辰"],
            "午": ["辰"],
            "未": ["辰"],
            "申": ["未"],
            "酉": ["未"],
            "戌": ["戌"],
            "亥": ["戌"],
        }
    },
    {
        "name": "天醫",
        "key_type": "zhi",
        "value_type": "zhi",
        "key_pillar": ["month"],
        "mapping": {
            "子": ["亥"],
            "丑": ["子"],
            "寅": ["丑"],
            "卯": ["寅"],
            "辰": ["卯"],
            "巳": ["辰"],
            "午": ["巳"],
            "未": ["午"],
            "申": ["未"],
            "酉": ["申"],
            "戌": ["酉"],
            "亥": ["戌"],
        }
    },
    {
        "name": "天乙貴人",
        "key_type": "gan",
        "value_type": "zhi",
        "key_pillar": ["day", "year"],
        "mapping": {
            "甲": ["未", "丑"],
            "乙": ["申", "子"],
            "丙": ["酉", "亥"],
            "丁": ["亥", "酉"],
            "戊": ["丑", "未"],
            "己": ["子", "申"],
            "庚": ["丑", "未"],
            "辛": ["寅", "午"],
            "壬": ["卯", "巳"],
            "癸": ["巳", "卯"],
        }
    },
    {
        "name": "文昌",
        "key_type": "gan",
        "value_type": "zhi",
        "key_pillar": ["day"],
        "mapping": {
            "甲": ["巳"],
            "乙": ["午"],
            "丙": ["申"],
            "丁": ["酉"],
            "戊": ["申"],
            "己": ["酉"],
            "庚": ["亥"],
            "辛": ["子"],
            "壬": ["寅"],
            "癸": ["卯"],
        }
    },
    {
        "name": "學堂",
        "key_type": "gan",
        "value_type": "zhi",
        "key_pillar": ["day"],
        "mapping": {
            "甲": ["亥"],
            "乙": ["午"],
            "丙": ["寅"],
            "丁": ["酉"],
            "戊": ["寅"],
            "己": ["酉"],
            "庚": ["巳"],
            "辛": ["子"],
            "壬": ["申"],
            "癸": ["卯"],
        }
    },
    {
        "name": "學士",
        "key_type": "gan",
        "value_type": "zhi",
        "key_pillar": ["day"],
        "mapping": {
            "甲": ["子"],
            "乙": ["亥"],
            "丙": ["卯"],
            "丁": ["寅"],
            "戊": ["午"],
            "己": ["巳"],
            "庚": ["午"],
            "辛": ["巳"],
            "壬": ["酉"],
            "癸": ["申"],
        }
    },
    {
        "name": "金輿",
        "key_type": "gan",
        "value_type": "zhi",
        "key_pillar": ["day"],
        "mapping": {
            "甲": ["辰"],
            "乙": ["巳"],
            "丙": ["未"],
            "丁": ["申"],
            "戊": ["未"],
            "己": ["申"],
            "庚": ["戌"],
            "辛": ["亥"],
            "壬": ["丑"],
            "癸": ["寅"],
        }
    },
    {
        "name": "羊刃",
        "key_type": "gan",
        "value_type": "zhi",
        "key_pillar": ["day"],
        "mapping": {
            "甲": ["卯"],
            "乙": ["寅"],
            "丙": ["午"],
            "丁": ["巳"],
            "戊": ["午"],
            "己": ["巳"],
            "庚": ["酉"],
            "辛": ["申"],
            "壬": ["子"],
            "癸": ["亥"],
        }
    },
    {
        "name": "紅豔",
        "key_type": "gan",
        "value_type": "zhi",
        "key_pillar": ["day"],
        "mapping": {
            "甲": ["午", "申"],
            "乙": ["午", "申"],
            "丙": ["寅"],
            "丁": ["未"],
            "戊": ["辰"],
            "己": ["辰"],
            "庚": ["戌"],
            "辛": ["酉"],
            "壬": ["子"],
            "癸": ["申"],
        }
    },
    {
        "name": "飛刃",
        "key_type": "gan",
        "value_type": "zhi",
        "key_pillar": ["day"],
        "mapping": {
            "甲": ["申"],
            "乙": ["酉"],
            "丙": ["子"],
            "丁": ["亥"],
            "戊": ["子"],
            "己": ["亥"],
            "庚": ["卯"],
            "辛": ["寅"],
            "壬": ["午"],
            "癸": ["巳"],
        }
    },
    {
        "name": "流霞",
        "key_type": "gan",
        "value_type": "zhi",
        "key_pillar": ["day"],
        "mapping": {
            "甲": ["酉"],
            "乙": ["戌"],
            "丙": ["未"],
            "丁": ["申"],
            "戊": ["巳"],
            "己": ["午"],
            "庚": ["辰"],
            "辛": ["卯"],
            "壬": ["亥"],
            "癸": ["寅"],
        }
    },
    {
        "name": "祿神",
        "key_type": "gan",
        "value_type": "zhi",
        "key_pillar": ["day"],
        "mapping": {
            "甲": ["寅"],
            "乙": ["卯"],
            "丙": ["巳"],
            "丁": ["午"],
            "戊": ["巳"],
            "己": ["午"],
            "庚": ["申"],
            "辛": ["酉"],
            "壬": ["亥"],
            "癸": ["子"],
        }
    },
]
#  ref: https://www.bazitai.com/blog/3424, https://www.ijfate.com/%E5%B0%8F%E5%85%92%E9%97%9C%E7%85%9E%E6%9F%A5%E8%A9%A2%E8%88%87%E8%A7%A3%E8%AA%AA/
xiao_er_guan_sha_rules = [
  {
    "name": "落井關",
    "key_type": "gan",
    "value_type": "zhi",
    "key_pillar": ["day", "year"],
    "value_pillar": ["time"],
    "mapping": {
      "甲": ["巳"],
      "乙": ["子"],
      "丙": ["申"],
      "丁": ["戌"],
      "戊": ["卯"],
      "己": ["巳"],
      "庚": ["子"],
      "辛": ["申"],
      "壬": ["戌"],
      "癸": ["卯"]
    }
  },
  {
    "name": "雞飛關",
    "key_type": "gan",
    "value_type": "zhi",
    "key_pillar": ["day", "year"],
    "value_pillar": ["time"],
    "mapping": {
      "甲": ["巳", "酉", "丑"],
      "乙": ["子"],
      "丙": ["子"],
      "丁": ["子"],
      "戊": ["子"],
      "己": ["巳", "酉", "丑"],
      "庚": ["亥", "卯", "未"],
      "辛": ["寅", "午", "戌"],
      "壬": ["寅", "午", "戌"],
      "癸": ["寅", "午", "戌"]
    }
  },
  {
    "name": "取命關",
    "key_type": "gan",
    "value_type": "zhi",
    "key_pillar": ["day", "year"],
    "value_pillar": ["time"],
    "mapping": {
      "甲": ["申", "子", "辰"],
      "乙": ["申", "子", "辰"],
      "丙": ["申", "子", "辰"],
      "丁": ["申", "子", "辰"],
      "戊": ["亥", "卯", "未"],
      "己": ["亥", "卯", "未"],
      "庚": ["亥", "卯", "未"],
      "辛": ["寅", "午", "戌"],
      "壬": ["寅", "午", "戌"],
      "癸": ["寅", "午", "戌"]
    }
  },
  {
    "name": "雷公關",
    "key_type": "gan",
    "value_type": "zhi",
    "key_pillar": ["day", "year"],
    "value_pillar": ["time"],
    "mapping": {
      "甲": ["午"],
      "乙": ["戌"],
      "丙": ["子"],
      "丁": ["子"],
      "戊": ["戌"],
      "己": ["午"],
      "庚": ["寅"],
      "辛": ["寅"],
      "壬": ["子"],
      "癸": ["子"]
    }
  },
  {
    "name": "斷腸關",
    "key_type": "gan",
    "value_type": "zhi",
    "key_pillar": ["day", "year"],
    "value_pillar": ["time"],
    "mapping": {
      "甲": ["午", "未"],
      "乙": ["午", "未"],
      "丙": ["辰", "巳"],
      "丁": ["辰", "巳"],
      "戊": ["午"],
      "己": ["未"],
      "庚": ["寅"],
      "辛": ["寅"],
      "壬": ["丑"],
      "癸": ["丑"]
    }
  },
  {
    "name": "千日關",
    "key_type": "gan",
    "value_type": "zhi",
    "key_pillar": ["day", "year"],
    "value_pillar": ["time"],
    "mapping": {
      "甲": ["辰", "午"],
      "乙": ["辰", "午"],
      "丙": ["申", "酉"],
      "丁": ["申", "酉"],
      "戊": ["巳", "戌"],
      "己": ["巳", "戌"],
      "庚": ["寅"],
      "辛": ["寅"],
      "壬": ["丑", "亥"],
      "癸": ["丑", "亥"]
    }
  },
#   {
#     "name": "煞腳關",
#     "key_type": "gan",
#     "value_type": "zhi",
#     "key_pillar": "day",
#     "value_pillar": ["time"],
#     "mapping": {
#       "甲": ["申", "酉"],
#       "乙": ["申", "酉"],
#       "丙": ["亥", "子"],
#       "丁": ["亥", "子"],
#       "戊": ["寅", "卯"],
#       "己": ["寅", "卯"],
#       "庚": ["巳", "午"],
#       "辛": ["巳", "午"],
#       "壬": ["辰", "戌", "丑", "未"],
#       "癸": ["辰", "戌", "丑", "未"]
#     }
#   },
  {
    "name": "鐵蛇關",
    "key_type": "gan",
    "value_type": "zhi",
    "key_pillar": ["day", "year"],
    "value_pillar": ["time"],
    "mapping": {
      "甲": ["辰"],
      "乙": ["辰"],
      "丙": ["未", "申"],
      "丁": ["未", "申"],
      "戊": ["寅", "丑"],
      "己": ["寅", "丑"],
      "庚": ["戌"],
      "辛": ["戌"],
      "壬": ["寅", "丑"],
      "癸": ["寅", "丑"]
    }
  },
  {
    "name": "白虎關",
    "key_type": "gan",
    "value_type": "zhi",
    "key_pillar": ["day", "year"],
    "value_pillar": ["time"],
    "mapping": {
      "甲": ["酉"],
      "乙": ["酉"],
      "丙": ["子"],
      "丁": ["子"],
      "戊": ["午"],
      "己": ["午"],
      "庚": ["卯"],
      "辛": ["卯"],
      "壬": ["午"],
      "癸": ["午"]
    }
  },
  {
    "name": "鬼門關",
    "key_type": "zhi",
    "value_type": "zhi",
    "key_pillar": ["day", "year"],
    "value_pillar": ["time"],
    "mapping": {
      "子": ["酉"],
      "丑": ["午"],
      "寅": ["未"],
      "卯": ["申"],
      "辰": ["亥"],
      "巳": ["戌"],
      "午": ["丑"],
      "未": ["寅"],
      "申": ["卯"],
      "酉": ["子"],
      "戌": ["巳"],
      "亥": ["辰"]
    }
  },
  {
    "name": "五鬼關",
    "key_type": "zhi", 
    "value_type": "zhi",
    "key_pillar": ["day", "year"],
    "value_pillar": ["time"],
    "mapping": {
      "子": ["辰"],
      "丑": ["卯"],
      "寅": ["寅"],
      "卯": ["丑"],
      "辰": ["子"],
      "巳": ["亥"],
      "午": ["戌"],
      "未": ["申"],
      "申": ["酉"],
      "酉": ["未"],
      "戌": ["午"],
      "亥": ["巳"]
    }
  },
  {
    "name": "天狗關",
    "key_type": "zhi",
    "value_type": "zhi",
    "key_pillar": ["day", "year"],
    "value_pillar": ["time"],
    "mapping": {
      "子": ["戌"],
      "丑": ["亥"],
      "寅": ["子"],
      "卯": ["丑"],
      "辰": ["寅"],
      "巳": ["卯"],
      "午": ["辰"],
      "未": ["巳"],
      "申": ["午"],
      "酉": ["未"],
      "戌": ["申"],
      "亥": ["酉"]
    }
  },
  {
    "name": "埋兒關",
    "key_type": "zhi",
    "value_type": "zhi",
    "key_pillar": ["day", "year"],
    "value_pillar": ["time"],
    "mapping": {
      "子": ["丑"],
      "丑": ["卯"],
      "寅": ["申"],
      "卯": ["丑"],
      "辰": ["卯"],
      "巳": ["申"],
      "午": ["丑"],
      "未": ["卯"],
      "申": ["申"],
      "酉": ["丑"],
      "戌": ["卯"],
      "亥": ["申"]
    }
  },
  {
    "name": "天吊關",
    "key_type": "zhi",
    "value_type": "zhi",
    "key_pillar": ["day", "year"],
    "value_pillar": ["time"],
    "mapping": {
      "子": ["巳", "午"],
      "丑": ["子", "卯"],
      "寅": ["辰", "午"],
      "卯": ["午", "申"],
      "辰": ["巳", "午"],
      "巳": ["子", "卯"],
      "午": ["辰", "午"],
      "未": ["午", "申"],
      "申": ["巳", "午"],
      "酉": ["子", "卯"],
      "戌": ["辰", "午"],
      "亥": ["午", "申"]
    }
  },
  {
    "name": "短命關",
    "key_type": "zhi",
    "value_type": "zhi",
    "key_pillar": ["day", "year"],
    "value_pillar": ["time"],
    "mapping": {
      "子": ["巳"],
      "丑": ["寅"],
      "寅": ["辰"],
      "卯": ["未"],
      "辰": ["巳"],
      "巳": ["寅"],
      "午": ["辰"],
      "未": ["未"],
      "申": ["巳"],
      "酉": ["寅"],
      "戌": ["辰"],
      "亥": ["未"]
    }
  },
  {
    "name": "和尚關",
    "key_type": "zhi",
    "value_type": "zhi",
    "key_pillar": ["day", "year"],
    "value_pillar": ["time"],
    "mapping": {
      "子": ["辰", "戌", "丑", "未"],
      "丑": ["子", "午", "卯", "酉"],
      "寅": ["寅", "申", "巳", "亥"],
      "卯": ["辰", "戌", "丑", "未"],
      "辰": ["子", "午", "卯", "酉"],
      "巳": ["寅", "申", "巳", "亥"],
      "午": ["辰", "戌", "丑", "未"],
      "未": ["子", "午", "卯", "酉"],
      "申": ["寅", "申", "巳", "亥"],
      "酉": ["辰", "戌", "丑", "未"],
      "戌": ["子", "午", "卯", "酉"],
      "亥": ["寅", "申", "巳", "亥"]
    }
  },
  {
    "name": "湯火關",
    "key_type": "zhi",
    "value_type": "zhi",
    "key_pillar": ["day", "year"],
    "value_pillar": ["time"],
    "mapping": {
      "子": ["午"],
      "丑": ["未"],
      "寅": ["寅"],
      "卯": ["午"],
      "辰": ["未"],
      "巳": ["寅"],
      "午": ["午"],
      "未": ["未"],
      "申": ["寅"],
      "酉": ["午"],
      "戌": ["未"],
      "亥": ["寅"]
    }
  },
  {
    "name": "夜啼關",
    "key_type": "zhi", 
    "value_type": "zhi",
    "key_pillar": ["day", "year"],
    "value_pillar": ["time"],
    "mapping": {
      "子": ["未"],
      "丑": ["酉"],
      "寅": ["寅", "未"],
      "卯": ["未"],
      "辰": ["酉"],
      "巳": ["寅", "未"],
      "午": ["未"],
      "未": ["酉"],
      "申": ["寅", "未"],
      "酉": ["未"],
      "戌": ["酉"],
      "亥": ["寅", "未"]
    }
  },
  {
    "name": "撞命關",
    "key_type": "zhi",
    "value_type": "zhi",
    "key_pillar": ["day", "year"],
    "value_pillar": ["time"],
    "mapping": {
      "子": ["巳"],
      "丑": ["未"],
      "寅": ["巳"],
      "卯": ["子"],
      "辰": ["午"],
      "巳": ["午"],
      "午": ["丑"],
      "未": ["丑"],
      "申": ["午"],
      "酉": ["亥"],
      "戌": ["未"], #午
      "亥": ["亥"]
    }
  },
#   {
#     "name": "直難關",
#     "key_type": "zhi",
#     "value_type": "zhi",
#     "key_pillar": ["month"],
#     "value_pillar": "time",
#     "mapping": {
#       "寅": ["午"],
#       "卯": ["午"],
#       "辰": ["未"],
#       "巳": ["未"],
#       "午": ["卯", "戌"],
#       "未": ["卯", "戌"],
#       "申": ["巳", "申"],
#       "酉": ["巳", "申"],
#       "戌": ["寅", "卯"],
#       "亥": ["寅", "卯"],
#       "子": ["辰", "酉"],
#       "丑": ["辰", "酉"]
#     }
#   },
  {
    "name": "水火關",
    "key_type": "zhi",
    "value_type": "zhi",
    "key_pillar": ["month"],
    "value_pillar": ["time"],
    "mapping": {
      "寅": ["未", "戌"],
      "卯": ["未", "戌"],
      "辰": ["未", "戌"],
      "巳": ["丑", "辰"],
      "午": ["丑", "辰"],
      "未": ["丑", "辰"],
      "申": ["丑", "辰"],
      "酉": ["丑", "辰"],
      "戌": ["丑", "辰"],
      "亥": ["未", "辰"],
      "子": ["未", "辰"],
      "丑": ["未", "辰"]
    }
  },
  {
    "name": "深水關",
    "key_type": "zhi",
    "value_type": "zhi",
    "key_pillar": ["month"],
    "value_pillar": ["time"],
    "mapping": {
      "寅": ["寅", "申"],
      "卯": ["寅", "申"],
      "辰": ["寅", "申"],
      "巳": ["未"],
      "午": ["未"],
      "未": ["未"],
      "申": ["酉"],
      "酉": ["酉"],
      "戌": ["酉"],
      "亥": ["丑"],
      "子": ["丑"],
      "丑": ["丑"]
    }
  },
  {
    "name": "四柱關",
    "key_type": "zhi",
    "value_type": "zhi",
    "key_pillar": ["month"],
    "value_pillar": ["time"],
    "mapping": {
      "寅": ["巳", "亥"],
      "卯": ["辰", "戌"],
      "辰": ["卯", "酉"],
      "巳": ["寅", "申"],
      "午": ["丑", "未"],
      "未": ["子", "午"],
      "申": ["巳", "亥"],
      "酉": ["辰", "戌"],
      "戌": ["卯", "酉"],
      "亥": ["寅", "申"],
      "子": ["丑", "未"],
      "丑": ["子", "午"]
    }
  },
  {
    "name": "將軍箭",
    "key_type": "zhi",
    "value_type": "zhi",
    "key_pillar": ["month"],
    "value_pillar": ["time","day","year"],
    "mapping": {
      "寅": ["酉", "戌", "辰"],
      "卯": ["酉", "戌", "辰"],
      "辰": ["酉", "戌", "辰"],
      "巳": ["未", "卯", "子"],
      "午": ["未", "卯", "子"],
      "未": ["未", "卯", "子"],
      "申": ["午", "寅", "丑"],
      "酉": ["午", "寅", "丑"],
      "戌": ["午", "寅", "丑"],
      "亥": ["亥", "申", "巳"],
      "子": ["亥", "申", "巳"],
      "丑": ["亥", "申", "巳"]
    }
  },
  {
    "name": "浴盆關",
    "key_type": "zhi",
    "value_type": "zhi",
    "key_pillar": ["month"],
    "value_pillar": ["time"],
    "mapping": {
      "寅": ["辰"],  # Spring - Dragon
      "卯": ["辰"],  # Spring - Dragon
      "辰": ["辰"],  # Spring - Dragon
      "巳": ["未"],  # Summer - Goat
      "午": ["未"],  # Summer - Goat
      "未": ["未"],  # Summer - Goat
      "申": ["戌"],  # Autumn - Dog
      "酉": ["戌"],  # Autumn - Dog
      "戌": ["戌"],  # Autumn - Dog
      "亥": ["丑"],  # Winter - Ox
      "子": ["丑"],  # Winter - Ox
      "丑": ["丑"]   # Winter - Ox
    }
  },
  {
    "name": "閻王關",
    "key_type": "zhi",
    "value_type": "zhi",
    "key_pillar": ["month"],
    "value_pillar": ["time"],
    "mapping": {
      "寅": ["丑", "未"],
      "卯": ["丑", "未"],
      "辰": ["丑", "未"],
      "巳": ["辰", "戌"],
      "午": ["辰", "戌"],
      "未": ["辰", "戌"],
      "申": ["子", "午"],
      "酉": ["子", "午"],
      "戌": ["子", "午"],
      "亥": ["寅", "卯"],
      "子": ["寅", "卯"],
      "丑": ["寅", "卯"]
    }
  },
  {
    "name": "無情關",
    "key_type": "zhi",
    "value_type": "zhi",
    "key_pillar": ["month"],
    "value_pillar": ["time"],
    "mapping": {
      "寅": ["寅", "酉", "子"],
      "卯": ["寅", "酉", "子"],
      "辰": ["寅", "酉", "子"],
      "巳": ["戌", "亥", "巳"],
      "午": ["戌", "亥", "巳"],
      "未": ["戌", "亥", "巳"],
      "申": ["申", "丑"],
      "酉": ["申", "丑"],
      "戌": ["申", "丑"],
      "亥": ["子", "午"],
      "子": ["子", "午"],
      "丑": ["子", "午"]
    }
  },
  {
    "name": "百日關",
    "key_type": "zhi",
    "value_type": "zhi",
    "key_pillar": ["month"],
    "value_pillar": ["time"],
    "mapping": {
      "寅": ["辰", "戌", "丑", "未"],
      "卯": ["寅", "申", "巳", "亥"],
      "辰": ["子", "午", "卯", "酉"],
      "巳": ["辰", "戌", "丑", "未"],
      "午": ["寅", "申", "巳", "亥"],
      "未": ["子", "午", "卯", "酉"],
      "申": ["辰", "戌", "丑", "未"],
      "酉": ["寅", "申", "巳", "亥"],
      "戌": ["子", "午", "卯", "酉"],
      "亥": ["辰", "戌", "丑", "未"],
      "子": ["寅", "申", "巳", "亥"],
      "丑": ["子", "午", "卯", "酉"]
    }
  },
  {
    "name": "四季關",
    "key_type": "zhi",
    "value_type": "zhi",
    "key_pillar": ["month"],
    "value_pillar": ["time"],
    "mapping": {
      "寅": ["丑", "巳"],
      "卯": ["丑", "巳"],
      "辰": ["丑", "巳"],
      "巳": ["辰", "申"],
      "午": ["辰", "申"],
      "未": ["辰", "申"],
      "申": ["亥", "未"],
      "酉": ["亥", "未"],
      "戌": ["亥", "未"],
      "亥": ["寅", "戌"],
      "子": ["寅", "戌"],
      "丑": ["寅", "戌"]
    }
  },
  {
    "name": "金鎖關",
    "key_type": "zhi",
    "value_type": "zhi",
    "key_pillar": ["month"],
    "value_pillar": ["time"],
    "mapping": {
      "寅": ["申"],
      "卯": ["酉"],
      "辰": ["戌"],
      "巳": ["亥"],
      "午": ["子"],
      "未": ["丑"],
      "申": ["申"],
      "酉": ["酉"],
      "戌": ["戌"],
      "亥": ["亥"],
      "子": ["子"],
      "丑": ["丑"]
    }
  },
  {
    "name": "斷橋關",
    "key_type": "zhi",
    "value_type": "zhi", 
    "key_pillar": ["month"],
    "value_pillar": ["time"],
    "mapping": {
      "寅": ["寅"],
      "卯": ["卯"],
      "辰": ["申"],
      "巳": ["丑"],
      "午": ["戌"],
      "未": ["酉"],
      "申": ["辰"],
      "酉": ["巳"],
      "戌": ["午"],
      "亥": ["未"],
      "子": ["亥"],
      "丑": ["子"]
    }
  },
  {
    "name": "急腳關",
    "key_type": "zhi",
    "value_type": "zhi",
    "key_pillar": ["month"],
    "value_pillar": ["time"], 
    "mapping": {
      "寅": ["亥", "子"],
      "卯": ["亥", "子"],
      "辰": ["卯", "未"],
      "巳": ["卯", "未"],
      "午": ["卯", "未"],
      "未": ["卯", "未"],
      "申": ["寅", "戌"],
      "酉": ["寅", "戌"],
      "戌": ["寅", "戌"],
      "亥": ["辰", "戌"],
      "子": ["辰", "戌"],
      "丑": ["辰", "戌"]
    }
  }
]



shensha_other_rules = [
    {
        "name": "天上三奇",
        "format": [(("day", "gan"), ("month", "gan"), ("year", "gan"))],
        "value": [("甲", "戊", "庚"), ("甲", "庚", "戊")],
    },
    {
        "name": "人中三奇",
        "format": [(("day", "gan"), ("month", "gan"), ("year", "gan"))],
        "value": [("壬", "癸", "辛"), ("壬", "辛", "癸")],
    },
    {
        "name": "地下三奇",
        "format": [(("day", "gan"), ("month", "gan"), ("year", "gan"))],
        "value": [("乙", "丙", "丁"), ("乙", "丁", "丙")],
    },
    {
        "name": "金神",
        "format": [(("day", "gan"), ("day", "zhi"))],
        "value": [("乙", "丑"), ("己", "巳")],
    },
    {
        "name": "福星",
        "format": [(("day", "gan"), ("day", "zhi"))],
        "value": [("甲", "寅"), ("乙", "丑"), ("乙", "亥"), ("丙", "子"), ("丙", "戌"), ("丁", "酉"), ("戊", "申"), ("己", "未"), ("庚", "午"), ("辛", "巳"), ("壬", "辰"), ("癸", "酉")],
    },
    {
        "name": "六秀",
        "format": [(("day", "gan"), ("day", "zhi"))],
        "value": [("戊", "子"), ("己", "丑"), ("戊", "午"), ("己", "未"), ("丙", "午"), ("丁", "未")],
    },
    {
        "name": "魁罡",
        "format": [(("day", "gan"), ("day", "zhi"))],
        "value": [("庚", "辰"), ("庚", "戌"), ("壬", "辰"), ("戊", "戌")],
    },
    {
        "name": "十靈",
        "format": [(("day", "gan"), ("day", "zhi"))],
        "value": [("甲", "辰"), ("乙", "亥"), ("丙", "辰"), ("丁", "酉"), ("戊", "午"), ("庚", "寅"), ("庚", "戌"), ("辛", "亥"), ("癸", "未"), ("壬", "寅")],
    },
    {
        "name": "進神",
        "format": [(("day", "gan"), ("day", "zhi"))],
        "value": [("甲", "子"), ("甲", "午"), ("己", "卯"), ("己", "酉")],
    },
    {
        "name": "天赦",
        "format": [(("month", "zhi"), ("day", "gan"), ("day", "zhi"))],
        "value": [
            ("寅", "戊", "寅"),
            ("卯", "戊", "寅"),
            ("辰", "戊", "寅"),
            ("巳", "甲", "午"),
            ("午", "甲", "午"),
            ("未", "甲", "午"),
            ("申", "戊", "申"),
            ("酉", "戊", "申"),
            ("戌", "戊", "申"),
            ("亥", "甲", "子"),
            ("子", "甲", "子"),
            ("丑", "甲", "子")
        ],
    },
    {
        "name": "陰陽煞",
        "format": [(("day", "gan"), ("day", "zhi"))],
        "value": [("丙", "子"), ("戊", "午")]
    },
    {
        "name": "八專",
        "format": [(("day", "gan"), ("day", "zhi"))],
        "value": [("甲", "寅"), ("乙", "卯"), ("丁", "未"), ("戊", "戌"), ("己", "未"), ("庚", "申"), ("辛", "酉"), ("癸", "丑")],
    },
]


